{
    "ERROR_NULL_ERROR_MESSAGE": "Código de error de marcador de posición para errores no especificados.",
	"ERROR_DEFAULT_ERROR_MESSAGE": "Se produjo un error desconocido durante el procesamiento de su solicitud. Reporte el error o revise los registros para obtener más información.",
	"ERROR_INVALID_CLIENT_FOR_AUTHENTICATION_GROUP_QUERY": "Cliente no válido para los grupos de autenticación.",
	"ERROR_INVALID_OR_MISSING_SUBJECT": "Asunto no válido o faltante.",
	"ERROR_INSUFFICIENT_PERMISSIONS": "Permisos insuficientes para realizar la operación.",
	"ERROR_INVALID_PERMISSION_FOR_TENANT": "Permisos no válidos para realizar la operación para este inquilino.",
	"ERROR_MISSING_TENANT_ID": "ID de inquilino faltante.",
	"ERROR_NO_MATCHING_TENANT_FOR_AUTHENTICATION_GROUP_QUERY": "No se encontraron inquilinos para los grupos de autenticación de usuarios.",
	"ERROR_INSUFFICIENT_PERMISSIONS_TO_VIEW_AUTHENTICATION_GROUP": "No tiene permiso para ver este grupo de autenticación.",
	"ERROR_TENANT_NOT_FOUND": "Inquilino no encontrado.",
	"ERROR_TENANT_IS_DISABLED_OR_MARKED_FOR_DELETE": "La operación no se puede realizar porque el inquilino principal está deshabilitado o marcado para su eliminación.",
	"ERROR_THE_AUTHENTICATION_GROUP_DOES_NOT_EXIST": "Grupo de autenticación no encontrado.",
	"ERROR_CLIENT_DOES_NOT_EXIST": "Cliente no encontrado.",
	"ERROR_CANNOT_ASSIGN_AUTHENTICATION_GROUP_TO_CLIENT": "El grupo de autenticación pertenece a un inquilino diferente al cliente y no se puede asignar.",
	"ERROR_USER_DOES_NOT_EXIST": "Usuario no encontrado.",
	"ERROR_INVALID_TENANT_FOR_USER_AUTHENTICATION_GROUP_ASSIGNMENT": "El usuario no se puede asignar al grupo de autenticación porque no pertenece al mismo inquilino.",
	"ERROR_KEY_DOES_NOT_EXIST": "Clave no encontrada.",
	"ERROR_INVALID_CONTACT_TYPE": "Tipo de contacto no válido.",
	"ERROR_INVALID_EMAIL": "Correo electrónico no válido.",
	"ERROR_OIDC_PROVIDER_NOT_ASSIGNED_TO_TENANT_FOR_READ_OPERATION": "Tiene permiso para ver el proveedor OIDC.",
	"ERROR_UNABLE_TO_ENCRYPT_OIDC_PROVIDER_CLIENT_SECRET": "Error al cifrar el secreto de cliente del proveedor OIDC.",
	"ERROR_MISSING_CLIENT_ID_IN_OIDC_CONFIGURATION": "Falta el valor del ID de cliente en la configuración del proveedor OIDC.",
	"ERROR_MISSING_WELL_KNOWN_URI_IN_OIDC_CONFIGURATION": "Falta el URI conocido en la configuración del proveedor OIDC.",
	"ERROR_MISSING_OIDC_PROVIDER_NAME": "Se requiere el nombre del proveedor.",
	"ERROR_NO_FEDERATED_OIDC_PROVIDER_FOUND": "No se encontró el proveedor OIDC.",
	"ERROR_ENTERPRISE_OIDC_PROVIDERS_CANNOT_BE_ASSIGNED_TO_A_TENANT": "No se pueden asignar proveedores OIDC empresariales a inquilinos.",
	"ERROR_CANNOT_ASSIGN_DOMAINS_TO_SOCIAL_OIDC_PROVIDERS": "No se pueden asignar dominios a proveedores OIDC de redes sociales.",
	"ERROR_DOMAIN_IS_ALREADY_ASSIGNED_TO_AN_EXTERNAL_OIDC_PROVIDER": "El dominio ya está asignado a un proveedor OIDC.",
	"ERROR_INSUFFICIENT_PERMISSIONS_TO_READ_AUTHORIZATION_GROUP": "No tiene permiso para ver este grupo de autorización.",
	"ERROR_AUTHORIZATION_GROUP_NOT_FOUND": "No se encontró el grupo de autorización.",
	"ERROR_INVALID_TENANT_FOR_USER_AUTHORIZATION_GROUP_ASSIGNMENT": "No se puede asignar un usuario al grupo de autorización porque no pertenece al mismo inquilino.",
	"ERROR_NO_ACCESS_TO_TENANT": "No tiene permiso para ver este inquilino.",
	"ERROR_INVALID_CLIENT_TYPE": "Tipo de cliente no válido o faltante.",
	"ERROR_UNABLE_TO_ENCRYPT_CLIENT_SECRET": "Error al cifrar el secreto de cliente.",
	"ERROR_OIDC_NOT_ENABLED_FOR_THIS_CLIENT": "OIDC (SSO) no está habilitado para este cliente.",
	"ERROR_INVALID_REDIRECT_URI": "URI de redirección no válido.",
	"ERROR_UNABLE_TO_FIND_A_ROOT_TENANT": "No se puede encontrar un inquilino raíz. La herramienta IAM requiere un inquilino raíz.",
	"ERROR_UNABLE_TO_FIND_OBJECT_FOR_DELETION": "No se puede encontrar el objeto para eliminar.",
	"ERROR_INSUFFICIENT_SCOPE_FOR_MARK_FOR_DELETION_OPERATION": "No tiene permisos para eliminar este objeto.",
	"ERROR_UNABLE_TO_DELETE_THE_ROOT_TENANT": "No se puede eliminar el inquilino raíz.",
	"ERROR_CANNOT_DELETE_CLIENT_ASSIGNED_TO_ROOT_TENANT_FOR_OUTBOUND_SERVICE_CALLS": "No se puede eliminar el cliente asignado al inquilino raíz para las llamadas de servicio salientes.",
	"ERROR_UNABLE_TO_DELETE_IAM_MANAGEMENT_SCOPE": "No se puede eliminar un ámbito utilizado para la gestión de IAM.",
	"ERROR_RATE_LIMIT_VIEW_NO_ASSIGNED_TENANT": "No tiene permisos para ver los límites de velocidad asignados a este inquilino.",
	"ERROR_RATE_LIMIT_SERVICE_GROUP_NOT_FOUND": "No se encontró el grupo de servicios de límite de velocidad.",
	"ERROR_TENENT_IS_ALREADY_ASSIGNED_RATE_LIMIT": "El inquilino ya tiene asignado este límite de velocidad.",
	"ERROR_TOTAL_RATE_LIMIT_EXCEEDED": "Se ha superado el límite de velocidad total.",
	"ERROR_CANNOT_FIND_EXISTING_TENANT_RATE_LIMIT_REL_TO_UPDATE": "El límite de velocidad no está asignado al inquilino.",
	"ERROR_PROVIDER_CANNOT_BE_MODIFIED": "El proveedor OIDC está bloqueado y no se puede modificar.",
	"ERROR_FEDERATED_OIDC_PROVIDER_SECRET_ENTRY_OTP_NOT_FOUND": "No se puede encontrar el código de acceso de un solo uso para configurar el secreto del proveedor OIDC.",
	"ERROR_FEDERATED_OIDC_PROVIDER_SECRET_KEY_ENTRY_OTP_IS_EXPIRED": "El código de acceso de un solo uso para configurar el secreto del proveedor OIDC ha caducado.",
	"ERROR_NO_PROVIDER_ASSIGNED_TO_TENANT_FOR_SECRET_VIEW": "El secreto no está disponible porque el proveedor no está asignado a su inquilino.",
	"ERROR_MISSING_KEY_NAME_OR_ALIAS": "Falta el nombre o alias de la clave.",
	"ERROR_MISSING_PRIVATE_KEY": "Falta la clave privada.",
	"ERROR_MUST_PROVIDE_EITHER_A_PUBLIC_KEY_OR_CERTIFICATE": "Falta una clave pública o un certificado.",
	"ERROR_ENCRYPTED_PRIVATE_KEY_REQUIRES_PASSPHRASE": "Una clave privada cifrada requiere una frase de contraseña.",
	"ERROR_INVALID_PASSPHRASE_LENGTH_FOR_PRIVATE_KEY": "Longitud de la frase de contraseña de la clave privada no válida.",
	"ERROR_MISSING_OR_INVALID_KEY_TYPE": "Tipo de clave no válido o no válido.",
	"ERROR_MISSING_OR_INVALID_KEY_USE": "Uso de la clave no válido o no válido.",
	"ERROR_INVALID_EXPIRATION_FOR_PUBLIC_KEY": "Fecha de caducidad de la clave pública no válida.",
	"ERROR_UNABLE_TO_ENCRYPT_PRIVATE_KEY_INFORMATION": "No se puede cifrar la clave privada ni la frase de contraseña.",
	"ERROR_MISSING_COMMON_NAME": "Falta el atributo de nombre común (CN).",
	"ERROR_MISSING_ORGANIZATION_NAME": "Falta el atributo de nombre de la organización (O).",
	"ERROR_INVALID_EXPIRATION_FOR_CERTIFICATE": "Fecha de caducidad del certificado no válida.",
	"ERROR_INVALID_SIGNING_KEY_STATUS": "Estado de la clave de firma no válido.",
	"ERROR_CANNOT_UPDATE_A_REVOKED_KEY": "No se puede actualizar una clave revocada.",
	"ERROR_NO_ACCESS_TO_SIGNING_KEY": "No tiene acceso a esta clave de firma.",
	"ERROR_INVALID_PROFILE_FOR_SCOPE_QUERY": "Su perfil no está configurado para consultar el alcance.",
	"ERROR_NO_PERMISSIONS_TO_VIEW_SCOPE": "No tiene permisos para ver los detalles del alcance.",
	"ERROR_NO_PERMISSION_TO_VIEW_TENANT_SCOPE": "No tiene permisos para ver el alcance de este inquilino.",
	"ERROR_INVALID_SCOPE_USAGE_FOR_CREATION": "Uso de alcance no válido.",
	"ERROR_SCOPE_NAME_AND_DESCRIPTION_MUST_BE_POPULATED": "El nombre y la descripción del alcance deben completarse.",
	"ERROR_SCOPE_EXISTS_WITH_SUPPLIED_NAME": "Ya existe un alcance con el nombre proporcionado.",
	"ERROR_SCOPE_NOT_FOUND": "No se encontró el alcance.",
	"ERROR_IAM_MANAGEMENT_SCOPE_IS_READ_ONLY": "El alcance utilizado para la gestión de IAM es de solo lectura y no se puede modificar.",
	"ERROR_CANNOT_FIND_TENANT_FOR_SCOPE_ASSIGNMENT": "No se encuentra el inquilino para la asignación de alcance.",
	"ERROR_CANNOT_REMOVE_IAM_MANAGEMENT_SCOPE_FROM_ROOT_TENANT": "El alcance de gestión de IAM no se puede eliminar del inquilino raíz.",
	"ERROR_SCOPE_IS_NOT_ASSIGNED_TO_THE_TENANT_OF_THIS_CLIENT": "El valor de alcance no está asignado al inquilino de este cliente.",
	"ERROR_CLIENT_DOES_NOT_BELONG_TO_TENANT": "El cliente utilizado para la asignación no pertenece al inquilino proporcionado.",
	"ERROR_UNABLE_TO_ASSIGN_SCOPE_TO_IDENTITY_CLIENT_TYPE": "No se pueden asignar valores de alcance a un tipo de cliente de identidad.",
	"ERROR_ONE_OR_MORE_SCOPE_VALUES_IS_NOT_ASSIGNED_TO_THE_TENANT_OF_THIS_AUTHORIZATION_GROUP": "Uno o más valores de alcance no están asignados al inquilino de este grupo de autorización.",
	"ERROR_SCOPE_IS_NOT_ASSIGNED_TO_THE_TENANT_OF_THIS_AUTHORIZATION_GROUP": "El valor de alcance no está asignado al inquilino de este grupo de autorización.",
	"ERROR_AUTHORIZATION_GROUP_DOES_NOT_BELONG_TO_TENANT": "El grupo de autorización utilizado para la asignación no pertenece al inquilino proporcionado.",
	"ERROR_USER_DOES_NOT_BELONG_TO_TENANT_FOR_SCOPE_ASSIGNMENT": "El usuario no pertenece al inquilino para la asignación de alcance.",
	"ERROR_ONE_OR_MORE_SCOPE_VALUES_IS_NOT_ASSIGNED_TO_THE_TENANT_THAT_THE_USER_BELONGS_TO": "Uno o más valores de alcance no están asignados al inquilino al que pertenece el usuario.",
	"ERROR_CANNOT_FIND_ACCESS_RULE_ID": "No se encontró la regla de acceso.",
	"ERROR_CANNOT_ASSIGN_ROOT_TENANT_SCOPE_TO_NON_ROOT_TENANT": "No se puede asignar un ámbito exclusivo de inquilino raíz a un inquilino no raíz.",
	"ERROR_NO_PERMISSIONS_FOR_SEARCH": "No tiene permiso para buscar datos de IAM.",
	"ERROR_NO_VALID_PERMISSIONS_DEFINED_FOR_SEARCH_TYPE": "El tipo de búsqueda solicitado no existe.",
	"ERROR_NO_PERMISSION_TO_VIEW_SEARCH_RESULT_TYPE": "No tiene permiso para ver este tipo de resultado de búsqueda.",
	"ERROR_PASSWORD_MINIMUM_LENGTH_OUT_OF_BOUNDS": "La longitud mínima de la contraseña está fuera de los límites.",
	"ERROR_PASSWORD_MAXIMUM_LENGTH_OUT_OF_BOUNDS": "La longitud máxima de la contraseña está fuera de los límites.",
	"ERROR_NO_MFA_TYPE_SPECIFIED_FOR_REQUIRED_MFA": "Se requiere MFA y no se ha seleccionado ningún tipo de MFA.",
	"ERROR_INVALID_MFA_TYPE_SUPPLIED": "El tipo de MFA proporcionado no es válido.",
	"ERROR_INVALID_PASSWORD_HASHING_ALGORITHM_SUPPLIED": "El algoritmo de hash de contraseña proporcionado no es válido.",
	"ERROR_INVALID_ROOT_CLIENT": "El cliente raíz no es válido.",
	"ERROR_CLIENT_DOES_NOT_BELONG_TO_THE_ROOT_TENANT": "El cliente no pertenece al inquilino raíz.",
	"ERROR_INVALID_AUTHENTICATION_STATE": "La autenticación falló debido a un paso que faltaba o porque la autenticación tardó demasiado.",
	"ERROR_AUTHENTICATION_INVALID_USER_ID": "El usuario no es válido para la autenticación.",
	"ERROR_USER_CANNOT_BE_AUTHENTICATED": "La cuenta de usuario está bloqueada o deshabilitada y no se puede autenticar.",
	"ERROR_AUTHENTICATION_FORGOT_PASSWORD_NO_BACKUP_EMIAL_CONFIGURED": "No se configuró ningún correo electrónico de recuperación con la dirección de correo electrónico proporcionada.",
	"ERROR_INVALID_PASSWORD_RESET_TOKEN": "El token de restablecimiento de contraseña no es válido.",
	"ERROR_REQUIRED_TERMS_AND_CONDITIONS_NOT_ACCEPTED": "No se aceptaron los términos y condiciones requeridos.",
	"ERROR_INVALID_USER_CODE_FOR_DEVICE_CODE_NOT_FOUND": "No se encontró el código que ingresó para registrar su dispositivo.",
	"ERROR_DEVICE_CODE_HAS_EXPIRED": "El código que ingresó para registrar su dispositivo ha caducado.",
	"ERROR_DEVICE_CODE_HAS_BEEN_FINALIZED": "El código que ingresó para registrar su dispositivo ya se usó.",
	"ERROR_INVALID_PRE_AUTH_TOKEN_OR_DEVICE_CODE": "Se denegó la autenticación.",
	"ERROR_INVALID_TENANT_FOR_PRE_AUTH_TOKEN": "No se pudo completar la autenticación debido a información incorrecta o faltante.",
	"ERROR_USER_IS_NOT_PERMITTED_TO_AUTHENTICATE_TO_THIS_TENANT": "No tiene permiso para autenticarse en este inquilino.",
	"ERROR_USER_DOES_NOT_BELONG_TO_VALID_AUTHENTICATION_GROUP_FOR_CLIENT": "No tiene permiso para autenticarse en la aplicación porque no pertenece a un grupo de autenticación asignado a esta aplicación.",
	"ERROR_USER_REGISTRATION_IS_NOT_PERMITTED_FOR_THIS_TENANT": "No se pudo encontrar su cuenta y no se permitió el registro para este inquilino.",
	"ERROR_NO_CREDENTIALS_FOUND_FOR_USER": "Falló la autenticación. No se encontraron credenciales para su cuenta.",
	"ERROR_NO_DOMAIN_FOUND_FOR_TENANT_MANAGEMENT": "No tiene permiso para administrar ningún inquilino.",
	"ERROR_EXCLUSIVE_TENANT_AND_NO_FEDERATED_OICD_PROVIDER": "Su cuenta no es válida para este inquilino o no se puede crear con él.",
	"ERROR_TENANT_DOES_NOT_ALLOW_FEDERATED_OIDC_PROVIDER_AUTHENTICATION": "Su cuenta se administra a través de un proveedor de identidad externo y este inquilino no permite la autenticación a través de un tercero.",
	"ERROR_UNABLE_TO_DETERMINE_AUTHORIZATION_PARAMETERS_FOR_FEDERATED_OIDC_PROVIDER": "No se pueden determinar los parámetros de autorización del proveedor de identidad externo.",
	"ERROR_USER_TENANT_REL_DOES_NOT_EXIST": "No se permite el acceso a los datos del usuario.",
	"ERROR_NO_MATCHING_USER_AND_NO_TENANT_SELF_REGISTRATION": "Su cuenta no existe y no se puede crear.",
	"ERROR_CONDITIONS_FOR_AUTHENTICATION_NOT_MET": "No es posible autenticar su cuenta.",
	"ERROR_INVALID_CREDENTIALS": "Error de autenticación. Credenciales no válidas.",
	"ERROR_USER_IS_LOCKED": "Su cuenta se ha bloqueado tras varios intentos fallidos de inicio de sesión.",
	"ERROR_AUTHENTICTION_IS_PAUSED_FOR_USER": "La autenticación está temporalmente deshabilitada para su cuenta. Espere antes de volver a intentarlo.",
	"ERROR_TOTP_TOKEN_INVALID": "El código de acceso que ha introducido no es válido.",
	"ERROR_INVALID_SECURITY_KEY_INPUT": "La clave de seguridad introducida no es válida.",
	"ERROR_NO_LEGACY_USER_MIGRATION_CONFIGURATION_FOUND": "Su cuenta no se puede autenticar con este inquilino.",
	"ERROR_INVALID_CREDENTIALS_FOR_USER_MIGRATION": "Error de autenticación. Credenciales no válidas.",
	"ERROR_NO_LEGACY_USER_PROFILE_FOUND": "Error de autenticación. No se pudo encontrar el perfil de su cuenta.",
	"ERROR_PASSWORD_DOES_NOT_MEET_REQUIRED_FORMAT": "Su contraseña no cumple con el formato requerido.",
	"ERROR_PASSWORD_HAS_BEEN_PREVIOUSLY_USED_WITHIN_THE_PASSWORD_HISTORY_PERIOD": "Su contraseña ya se ha utilizado. Elija otra.",
	"ERROR_CREATING_TOTP": "Se ha producido un error al crear el código de acceso de un solo uso basado en tiempo.",
	"ERROR_VALIDATING_SECURITY_KEY_REGISTRATION_INPUT": "Se ha producido un error al validar el registro de la clave de seguridad.",
	"ERROR_NOT_A_VALID_SOCIAL_OIDC_PROVIDER": "Autenticación solo permitida para proveedores de identidad de redes sociales de terceros.",
	"ERROR_SOCIAL_PROVIDER_NOT_ASSIGNED_TO_TENANT": "No se permite la autenticación con un proveedor de identidad de redes sociales para este inquilino.",
	"ERROR_INVALID_TENANT_FOR_AUTHENTICATION_COMPLETION": "No se puede completar la autenticación debido a un inquilino faltante o no válido.",
	"ERROR_GENERATING_ACCESS_TOKEN_AUTHENTICATION_COMPLETION": "Se produjo un error al completar la autenticación.",
	"ERROR_REGISTRATION_FOR_USER_ALREADY_IN_PROGRESS": "No se puede iniciar el registro. Hay un registro activo en curso para esta cuenta.",
	"ERROR_REGISTRATION_NO_USER_FOUND_FOR_EMAIL_VALIDATION_TOKEN": "El token de validación que ingresó no es válido.",
	"ERROR_INVALID_USER_FOUND_FOR_TOKEN": "El token de validación que ingresó no es válido.",
	"ERROR_NO_RECOVERY_EMAIL_FOUND": "No se encontró su correo electrónico de recuperación.",
	"ERROR_NO_DURESS_PASSWORD_SUPPLIED": "No se proporcionó una contraseña de coacción.",
	"ERROR_PASSWORD_COUNT_INCORRECT": "No hay credenciales para su cuenta. No se puede crear una contraseña de coacción.",
	"ERROR_DURESS_PASSWORD_HAS_BEEN_USED_DURING_REGISTRATION": "La contraseña de coacción que ingresó ya se utilizó durante el registro. Elija otra contraseña de coacción.",
	"ERROR_NO_RECOVERY_EMAIL_SUPPLIED": "No se proporcionó un correo electrónico de recuperación.",
	"ERROR_RECOVERY_ACCOUNT_ALREADY_EXISTS_FOR_USER": "Ya existe un correo electrónico de recuperación para su cuenta.",
	"ERROR_EMAIL_ALREADY_IN_USE": "El correo electrónico no está disponible.",
	"ERROR_INVALID_EMAIL_ADDRESS": "El correo electrónico no tiene un formato válido.",
	"ERROR_DOMAIN_IS_MANAGED_BY_EXTERNAL_OIDC_PROVIDER": "La dirección de correo electrónico no está permitida.",
	"ERROR_UNABLE_TO_ADD_RECOVERY_EMAIL": "No se puede agregar un correo electrónico de recuperación para esta cuenta.",
	"ERROR_CANNOT_BE_MODIFIED": "Esta cuenta no se puede modificar.",
	"ERROR_USER_PROFILE_IS_CONTROLLED_BY_3RD_PARTY_IDP": "Su perfil se gestiona a través de un proveedor de identidad externo y no se puede modificar.",
	"ERROR_NO_PERMISSIONS_TO_ADD_RECOVERY_EMAIL": "No tiene permiso para agregar un correo electrónico de recuperación para esta cuenta.",
	"ERROR_INVALID_EMAIL_CHANGE_STATE": "El cambio de correo electrónico falló debido a un paso que faltaba o porque se agotó el tiempo de espera de la solicitud de cambio.",
	"ERROR_NO_VALID_REGISTRATION_STATE_FOUND": "El registro falló debido a un paso que faltaba o porque el registro tardó demasiado.",
	"ERROR_NO_USER_FOUND_FOR_REGISTRATION_COMPLETION": "El registro no se puede completar porque no se encuentra la cuenta de usuario.",
	"ERROR_INVALID_TENANT_FOR_REGISTRATION_COMPLETION": "El registro no se puede completar porque no se encuentra el inquilino.",
	"ERROR_GENERATING_ACCESS_TOKEN_REGISTRATION_COMPLETION": "Se produjo un error al crear un token de acceso para su cuenta. No se puede conceder acceso en este momento.",
	"ERROR_NOT_AUTHORIZED_FOR_USER_UPDATE": "No tiene permisos para actualizar el usuario.",
	"ERROR_USER_IS_MARKED_FOR_DELETE_AND_CANNOT_BE_UPDATED": "La cuenta de usuario está marcada para eliminarse y no se puede modificar.",
	"ERROR_TENANT_DOES_NOT_ALLOW_USER_SELF_REGISTRATION": "Este inquilino no permite el autorregistro de usuarios.",
	"ERROR_INVALID_PASSWORD_EITHER_PROHIBITED_OR_INVALID_FORMAT": "La contraseña que ingresó tiene un formato no válido o no está permitida porque se sabe que es una contraseña débil.",
	"ERROR_INVALID_EMAIL_DOMAIN": "El dominio de correo electrónico no es válido.",
	"ERROR_REGISTRATION_DOMAIN_IS_MANAGED_BY_EXTERNAL_OIDC_PROVIDER": "No puedes registrar un correo electrónico con un dominio administrado externamente.",
	"ERROR_REGISTRATION_TENANT_HAS_RESTRICTED_EMAIL_DOMAINS": "El inquilino con el que intentas registrarte no permite direcciones de correo electrónico con tu dominio.",
	"ERROR_INVALID_USER_TENANT_RELATIONSHIP_TYPE": "Tipo de relación usuario-inquilino no válido.",
	"ERROR_TENANT_USER_ASSGNMENT_MUST_BE_PRIMARY_TENANT": "La primera relación usuario-inquilino debe ser de tipo principal.",
	"ERROR_NO_PRIMARY_RELATIONSHIP_EXISTS_FOR_THE_USER_AND_TENANT": "Para poder asignar el usuario a este inquilino, debe existir una relación principal entre el usuario y otro inquilino.",
	"ERROR_MUST_BE_GUEST_TENANT": "El usuario que se va a asignar a este inquilino debe ser de tipo no principal o invitado.",
	"ERROR_CANNOT_ASSIGN_TO_A_GUEST_RELATIONSHIP": "No se puede asignar una relación invitado a una relación principal.",
	"ERROR_CANNOT_CANNOT_REMOVE_A_PRIMARY_RELATIONSHIP": "No se puede eliminar una relación usuario-inquilino principal.",
	"ERROR_INVALID_USER_PROFILE": "Perfil de usuario no válido.",
	"ERROR_NO_RECOVERY_EMAIL_EXISTS": "No existe un correo electrónico de recuperación.",
	"ERROR_TOTP_ALREADY_CONFIGURED_FOR_THE_USER": "Ya se ha configurado una contraseña de un solo uso temporal para esta cuenta.",
	"ERROR_UNABLE_TO_GENERATE_TOPT_SECRET": "No se puede generar un secreto de código de acceso de un solo uso temporal.",
	"ERROR_NO_TOTP_ASSIGNED_TO_USER": "No se ha configurado ningún código de acceso de un solo uso temporal para esta cuenta.",
	"ERROR_UNABLE_TO_DETERMINE_TOPT_SECRET": "No se puede recuperar el código de acceso de un solo uso temporal.",
	"ERROR_NO_EXISTING_SECURITY_KEY_CHALLENGE_FOR_USER": "No existe una clave de seguridad para esta cuenta.",
	"ERROR_SECURITY_KEY_CHALLENGE_HAS_EXPIRED": "El desafío de la clave de seguridad ha expirado.",
	"ERROR_UNABLE_OBTAIN_REGISTRATION_INFO_FOR_THE_KEY": "No se puede encontrar la información de registro de la clave de seguridad.",
	"ERROR_USER_IS_NOT_ENABLED_FOR_SECURITY_KEY_REGISTRATION": "Esta cuenta no está habilitada para el registro de claves de seguridad.",
	"ERROR_NO_SECURITY_KEY_CONFIGURED_FOR_USER": "No se ha configurado ninguna clave de seguridad para esta cuenta.",
	"ERROR_SECURITY_KEY_NO_CREDENTIAL_ID_FOUND": "No se encontró ningún ID de credencial para esta clave de seguridad.",
	"ERROR_INVALID_CREDENTIAL_ID": "El ID de credencial de seguridad no es válido.",
	"ERROR_CANNOT_OBTAIN_COUNTER_VALUE": "No se puede determinar el valor del contador de la clave de seguridad.",
	"ERROR_INVALID_PRE_AUTHENTICATION_TOKEN": "No se puede encontrar su sesión de autorización.",
	"ERROR_PRE_AUTHENTICATION_TOKEN_IS_EXPIRED": "Su sesión de autorización ha expirado.",
	"ERROR_YOU_DO_NOT_HAVE_SUFFICIENT_PERMISSIONS_TO_VIEW_THIS_PAGE": "No tiene permisos suficientes para ver esta página.",
	"ERROR_AUDIT_RECORD_RETENTION_PERIOD_MUST_BE_GREATER_THAN_0_DAYS": "El periodo de retención del registro de auditoría debe ser superior a 0 días.",
	"ERROR_SERVICE_ACCOUNT_INCOMPATABLE_WITH_OIDC": "No se puede habilitar una cuenta de servicio para OIDC (SSO).",
	"ERROR_PKCE_CANNOT_BE_ENABLED_BECAUSE_OIDC_IS_NOT_ENABLED": "No se puede habilitar PKCE porque OIDC (SSO) no está habilitado.",
	"ERROR_AUTHENTICATION_GROUPS_CANNOT_BE_ADDED_TO_SERVICE_CLIENTS": "No se pueden agregar grupos de autenticación a los clientes de la cuenta de servicio.",
	"SEARCH": "Buscar",
	"TENANT_LIST": "Lista de inquilinos",
	"CLIENT_LIST": "Lista de clientes",
	"USER_LIST": "Lista de usuarios",
	"AUTHORIZATION_GROUPS": "Grupos de autorización",
	"AUTHENTICATION_GROUPS": "Grupos de autenticación",
	"SCOPE_ACCESS_CONTROL": "Alcance/Control de acceso",
	"OIDC_PROVIDERS": "Proveedores de OIDC",
	"RATE_LIMITS": "Límites de velocidad",
	"KEYS": "Claves",
	"SYSTEM_SETTINGS": "Configuración del sistema",
	"RUNNING_JOBS": "Trabajos en ejecución",
	"CREATE_NEW": "Crear nuevo",
	"TENANT": "Inquilino",
	"CLIENT": "Cliente",
	"AUTHORIZATION_GROUP": "Grupo de autorización",
	"OIDC_PROVIDER": "Proveedor OIDC",
	"RATE_LIMIT": "Límite de velocidad",
	"KEY": "Clave",
	"CANCEL": "Cancelar",
	"NEXT": "Siguiente",
	"CREATE": "Crear",
	"FILTER_TENANTS": "Filtrar inquilinos",
	"TENANT_NAME": "Nombre del inquilino",
	"TENANT_DESCRIPTION": "Descripción del inquilino",
	"TENANT_TYPE": "Tipo de inquilino",
	"ENABLED": "Habilitar",
	"OBJECT_ID": "ID de objeto",
	"CLIENT_NAME": "Nombre del cliente",
	"CLIENT_DESCRIPTION": "Descripción del cliente",
	"CLIENT_TYPE": "Tipo de cliente",
	"USER_NAME": "Nombre de usuario",
	"EMAIL": "Correo electrónico",
	"GROUP_NAME": "Nombre del grupo",
	"GROUP_DESCRIPTION": "Descripción del grupo",
	"SCOPE_NAME": "Nombre del ámbito",
	"SCOPE_DESCRIPTION": "Descripción del alcance",
	"SCOPE_USE": "Uso",
	"PROVIDER_NAME": "Nombre del proveedor",
	"PROVIDER_DESCRIPTION": "Descripción del proveedor",
	"TYPE": "Tipo",
	"SERVICE_GROUP_NAME": "Nombre del grupo de servicios",
	"SERVICE_GROUP_DESCRIPTION": "Descripción del grupo de servicios",
	"KEY_NAME": "Nombre/alias de la clave",
	"KEY_TYPE": "Tipo de clave",
	"KEY_USE": "Uso de la clave",
	"STATUS": "Estado",
	"ITEMS_MARKED_FOR_DELETION": "Elementos marcados para su eliminación",
	"CURRENT_SCHEDULED_ITEMS": "Elementos programados actuales",
	"NO_MARKED_FOR_DELETE": "No hay objetos marcados para su eliminación",
	"LOCK_NAME": "Nombre del bloqueo",
	"LOCK_ID": "ID del bloqueo",
	"NO_SCHEDULED_ITEMS": "No hay elementos programados",
	"FEDERATED_OIDC_PROVIDER_CONSTRAINT": "Restricción del proveedor OIDC federado",
	"DEFAULT_RATE_LIMIT": "Límite de velocidad predeterminado",
	"TOTAL_USED": "Total usado",
	"DEFAULT_RATE_LIMIT_PERIOD_MINUTES": "Período del límite de velocidad predeterminado (minutos)",
	"ALLOW_UNLIMITED_API_RATES": "Permitir velocidades de API ilimitadas",
	"ALLOW_USER_SELF_REGISTRATION": "Permitir autorregistro de usuario",
	"ALLOW_ANONYMOUS_USERS": "Permitir usuarios anónimos",
	"ALLOW_SOCIAL_LOGIN": "Permitir inicio de sesión con redes sociales",
	"VERIFY_EMAIL_ON_REGISTRATION": "Verificar correo electrónico al registrarse",
	"MIGRATE_LEGACY_USERS": "Migrar usuarios antiguos",
	"ALLOW_LOGIN_BY_PHONE_NUMBER": "Permitir inicio de sesión por número de teléfono",
	"ALLOW_PASSWORD_RECOVERY": "Permitir recuperación de contraseña",
	"REQUIRE_CAPTCHA_ON_REGISTRATION": "Requerir CAPTCHA al registrarse",
	"REQUIRE_TERMS_AND_CONDITIONS_ACCEPTANCE": "Requerir aceptación de los Términos y Condiciones",
	"TERMS_AND_CONDITIONS_URI": "URI de los Términos y Condiciones",
	"SIGN_IN": "Iniciar sesión",
	"PASSWORD": "Contraseña",
	"BACK": "Atrás",
	"FORGOT_PASSWORD": "¿Olvidó su contraseña?",
	"LOGIN": "Iniciar sesión",
	"ENTER_CODE_FROM_AUTHENTICATOR_APP": "Ingrese el código de su aplicación de autenticación",
	"ONE_TIME_PASSCODE": "Código de un solo uso",
	"CONFIRM": "Confirmar",
	"SELECT_TENANT": "Seleccionar inquilino",
	"SELECT_PASSWORD_RECOVERY_OPTION": "Seleccione su opción de recuperación de contraseña",
	"USE_PRIMARY_EMAIL": "Usar mi contraseña principal Correo electrónico",
	"USE_RECOVERY_EMAI": "Tengo un correo electrónico de recuperación que quiero usar",
	"SUBMIT": "Enviar",
	"ENTER_EMAIL_OR_PHONE_NUMBER": "Correo electrónico o número de teléfono",
	"REGISTER": "Registrarse",
	"ENTER_NEW_PASSWORD": "Ingrese su nueva contraseña",
	"REQUIRE_NEW_PASSWORD": "Para continuar accediendo, debe actualizar su contraseña. Ingrese su nueva contraseña a continuación.",
	"PASSWORD_RULES": "Reglas",
	"REPEAT_PASSWORD": "Repetir contraseña",
	"UPDATE": "Actualizar",
	"VALIDATE_EMAIL_WITH_TOKEN": "Se ha enviado un código de verificación a su correo electrónico. Ingréselo a continuación. El código es válido por 60 minutos.",
	"TOTP_REQUIRED_FOR_ACCESS": "Para acceder a este inquilino, deberá configurar un código de acceso de un solo uso (OTP) con una aplicación de autenticación (como Google Authenticator o Microsoft Authenticator).",
	"TOTP_CONFIGURE_APP_FOR_CODE": "Use el código QR o el valor secreto para configurar el OTP en su dispositivo. Una vez completado, haga clic en \"Siguiente\".",
	"PLAIN_TEXT_VALUE_OF_THE_SECRET": "Valor del secreto en texto sin formato",
	"OPTIONAL_TOTP_CONFIGURATION": "¿Desea configurar un código de acceso de un solo uso (OTP)? No es obligatorio, pero se recomienda. Necesitará una aplicación de autenticación (como Google Authenticator o Microsoft Authenticator).",
	"SKIP": "Omitir",
	"CONFIGURE": "Configurar",
	"ENTER_TOTP_CODE": "Ingrese el código desde su aplicación de autenticación",
	"SECURITY_KEY_REQUIRED": "Para acceder a este inquilino, se requiere autenticación multifactor con una clave de seguridad. Necesitará un dispositivo de hardware como una YubiKey o la Llave de Seguridad Titan de Google.",
	"SECURITY_KEY_OPTIONAL": "¿Desea configurar una llave de seguridad? Este paso es opcional y requiere un dispositivo de hardware como una YubiKey o la Llave de Seguridad Titan de Google.",
	"CONFIGURE_SECURITY_KEY": "Configurar Llave",
	"GENERATING_CHALLENGE": "Generando desafío...",
	"VALIDATE_YOUR_SECURITY_KEY": "Valide su llave de seguridad",
	"VALIDATE_SECURITY_KEY": "Valide la llave",
	"TERMS_AND_CONDITIONS_REQUIRED_BEFORE_CONTINUING": "Esta aplicación tiene términos y condiciones que debe aceptar antes de continuar.",
	"I_AGREE_TO_ACCEPT": "Acepto los",
	"THIS_SITE_USES_THE_FOLLOWING": "Este sitio utiliza los siguientes",
	"TERMS_AND_CONDITIONS": "Términos y condiciones",
	"FIRST_NAME": "Nombre",
	"LAST_NAME": "Apellidos",
	"MIDDLE_NAME": "Segundo nombre",
	"NAME_ORDER": "Orden del nombre",
	"PHONE_NUMBER": "Número de teléfono",
	"PREFERRED_LANGUAGE": "Idioma preferido",
	"ADDRESS": "Dirección",
	"ADDRESS_LINE_1": "(Opcional) Apartamento, suite, unidad, edificio, piso",
	"CITY": "Ciudad",
	"COUNTRY": "País",
	"STATE_PROVINCE_REGION": "Estado/Provincia/Región",
	"POSTAL_CODE": "Código postal",
	"OPTIONAL_ADD_RECOVERY_EMAIL": "¿Desea agregar un correo electrónico de recuperación? No es obligatorio, pero se recomienda. Puede agregar uno más adelante si lo desea.",
	"ADD": "Agregar",
	"OPTIONAL_ADD_DURESS_PASSWORD": "¿Desea agregar una contraseña de coacción? No es obligatorio. Puede agregarla más adelante si lo desea.",
	"CONFIRM_DELETION_OF_MFA": "Confirmar eliminación de MFA",
	"PROFILE_IS_EXTERNALLY_MANAGED": "Su perfil se gestiona a través de un proveedor de identidad externo. Solo puede realizar cambios limitados en su perfil en esta página.",
	"EMAIL_VERIFIED": "Correo electrónico verificado",
	"RECOVERY_EMAIL_VERIFIED": "Correo electrónico de recuperación verificado",
	"USER_ID_COPIED_TO_CLIPBOARD": "ID de usuario copiado al portapapeles",
	"ADD_RECOVERY_EMAIL": "Añadir un correo electrónico de recuperación",
	"RECOVERY_EMAIL": "Correo electrónico de recuperación",
	"FEDERATED_OIDC_PROVIDER_SUBJECT_ID": "ID de sujeto del proveedor de OIDC federado",
	"MULTI_FACTOR_AUTHENTICATION": "Autenticación multifactor",
	"TIME_BASED_OTP": "Código de acceso de un solo uso basado en tiempo",
	"SECURITY_KEY": "Clave de seguridad",
	"PROFILE_UPDATED": "Perfil actualizado",
	"SCOPE_PERMISSION_REQUEST": "Solicita su permiso para acceder a las siguientes funciones o servicios",
    "ERROR_NO_AUTHORIZATION_ENDPOINT_CONFIGURED": "No se ha configurado ninguna URI de autorización.",
    "ERROR_NO_REGISTRATION_REDIRECT_URI_CONFIGURED": "No se ha configurado ninguna URI de registro.",
    "ERROR_NO_REDIRECT_ENDPOINT_CONFIGURED": "No se ha configurado ninguna URI de redirección.",
    "ERROR_NO_TENANT_TO_SELECT": "No hay ningún inquilino para seleccionar.",
    "ERROR_OIDC_AUTHORIZATION_FAILED_CLIENT_CONFIGURATION_ERROR": "Se ha producido un error en la configuración del cliente o de la aplicación de referencia.",
    "ERROR_OIDC_AUTHORIZATION_FAILED_NO_LOGIN_PERMITTED": "No se permitirá el inicio de sesión hasta que se resuelvan los problemas. Inténtelo de nuevo más tarde o póngase en contacto con el servicio de asistencia si el problema persiste.",
    "NEED_TO_CREATE_AN_ACCOUNT": "¿Necesita crear una cuenta?",
    "OR": "O bien,",
    "SIGN_IN_WITH": "Iniciar sesión con",
    "SELECT_A_LANGUAGE": "Seleccionar un idioma",
    "WELCOME": "Bienvenido",
    "QUICK_LINKS": "Enlaces rápidos",
    "CONFIGURE_KEY": "Configurar clave",
    "ERROR_RECAPTCHA_NOT_CONFIGURED_FOR_TENANT_WHICH_REQUIRES_RECAPTCHA": "No se ha configurado Recaptcha para un inquilino que lo requiere para el registro.",
    "ERROR_INVALID_RECAPTCHA_VERSION_EXPECTING_VERSION_3": "Se produjo un error al validar su registro.",
    "ERROR_INVALID_RECAPTCHA_TOKEN": "Se produjo un error al validar su registro.",
    "ERROR_RECAPTCHA_SCORE_LOWER_THAN_ALLOWED": "Se produjo un error al validar su registro. Esto podría deberse a que es un bot. Espere 30 minutos o más antes de volver a intentarlo.",
    "ERROR_V3_RECAPTCHA_REQUIRES_MINIMUM_SCORE_THRESHOLD_VALUE": "La versión 3 de ReCaptcha requiere un valor mínimo de umbral de puntuación.",
    "ERROR_RECAPTCHA_MINIMUM_SCORE_MUST_BE_BETWEEN_1_AND_0": "El valor mínimo de umbral de puntuación debe estar entre 0.0 y 1.0.",
    "ERROR_FAILURE_TO_ENCRYPT_THE_RECAPTCHA_API_KEY": "Se produjo un error al cifrar la clave API de ReCaptcha.",
    "ERROR_TENANT_NAME_MIN_LENGTH": "El nombre del inquilino es demasiado corto.",
    "ERROR_CANNOT_CREATE_ANOTHER_ROOT_TENANT": "Ya existe un inquilino raíz.",
    "ERROR_CANNOT_ASSIGN_AS_ROOT_TENANT": "El inquilino no se puede asignar como inquilino raíz.",
    "ERROR_INVALID_URL_FOR_TERMS_AND_CONDITIONS": "La URL del enlace de términos y condiciones no es válida.",
    "ERROR_NO_TERMS_AND_CONDITIONS_URL_WAS_SPECIFIED": "La URL de términos y condiciones es obligatoria.",
    "ERROR_NO_DEFAULT_RATE_LIMIT_SPECIFIED_FOR_LIMITED_API_RATE": "Se debe especificar un valor límite de tasa."
}